---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralFoundationLength
source: html/ff7e6316-2b9a-ba7b-0895-5d0a47a29349.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralFoundationLength Property

"Length"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralFoundationLength { get; }
```